app/Controllers/admin/MetaDataController.php

SELECT *
FROM `meta_data`
---
    public function index()
    {
        $data['meta_data'] = $this->metaModel->findAll();