app/Controllers/user/Aktivitasctrl.php

    public function index($slug = null)
    {
        $lang = session()->get('lang') ?? 'en';

        // Ambil data dari model.
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'lang' => $lang,
            'isIndonesian' => $lang === 'id', // Tambahkan variabel ini
        ];

        helper('text');

        // Pastikan data profil tidak kosong.
        if (empty($data['profil'])) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Data profil tidak ditemukan.');
        }

        // Ambil aktivitas sesuai dengan slug jika ada
        if ($slug === null) {
            $data['tbaktivitas'] = $this->AktivitasModel->findAll();
---
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_aktivitas`