app/Controllers/user/Homectrl.php

SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_aktivitas`
SELECT *
FROM `meta_data`
WHERE `feature` = 'home'
 LIMIT 1
---
    public function index()
    {
        $lang = session()->get('lang') ?? 'en';
        // Ambil data dari model lain
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findAll(),
            'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(),
            'lang' => $lang
        ];

        // Ambil data metadata
        $metaData = $this->MetadataModel->where('feature', 'home')->first(); // Mengambil data metadata